app/views/articles/_form.html.erb

SELECT "categories".* FROM "categories"
---

                                <% Category.all.each do |category| %>