app/views/articles/index.html.erb

                    <% palabra = " Categorias: " %>
                    <% article.categories.each do |category| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "has_categories" ON "categories"."id" = "has_categories"."category_id" WHERE "has_categories"."article_id" = ?  [["article_id", 29]]