app/views/partials/_panel.html.erb

  <%= link_to "Categorias", categories_path, class: "list-group-item list-group-item-action active" %>
    <% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"