app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
  def search
    if params[:titulo]

      @articles = Article.titulo(params[:titulo])

    else

      @articles = Article.all

SELECT "categories".* FROM "categories"
---
  def new

    @article = Article.new

    @categories = Category.all

INSERT INTO "has_categories" ("article_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["article_id", 26], ["category_id", 11], ["created_at", "2018-11-01 14:40:25.053426"], ["updated_at", "2018-11-01 14:40:25.053426"]]
INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)
---
  def create

    if params[:categories].nil?
      redirect_to new_article_path, warning: "Debes seleccionar minimo una categoria"

    else
      @article = current_user.articles.new(article_params)
          # current_user = detecta si el usuario esta logeado

      @article.categories = params[:categories]

      respond_to do |format|
        if @article.save

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 33]]
---
  def destroy

    #usara el set_articles, Primero

    @article.destroy

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 33], ["LIMIT", 1]]
---
  def set_articles

    @article = Article.find(params[:id])