app/controllers/articles_controller.rb

  def index
    @articles = Article.all
---
SELECT "articles".* FROM "articles" ORDER BY created_at DESC

  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "prueba"], ["body", "prueba"], ["created_at", "2018-10-29 16:38:48.534217"], ["updated_at", "2018-10-29 16:38:48.534217"], ["user_id", 1]]

  def destroy

    #usara el set_articles, Primero

    @article.destroy
---
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 24]]

  def update

    #usara el set_articles, Primero

    respond_to do |format|

      if @article.update(article_params)
---
UPDATE "articles" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Titulo30"], ["body", "Cuerpo30"], ["updated_at", "2018-10-28 07:20:28.282055"], ["id", 7]]

  def set_articles

    @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]