app/controllers/categories_controller.rb

  def create
    @category = current_user.categories.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "color", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["name", "1212121212"], ["color", "#000000"], ["created_at", "2018-11-01 02:02:18.355947"], ["updated_at", "2018-11-01 02:02:18.355947"], ["user_id", 1]]

  def update
    respond_to do |format|
      if @category.update(category_params)
---
UPDATE "categories" SET "name" = ?, "color" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "Cursos22"], ["color", "#000000"], ["updated_at", "2018-11-01 01:41:09.587292"], ["id", 3]]