app/models/article.rb

INSERT INTO "has_categories" ("article_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["article_id", 33], ["category_id", 17], ["created_at", "2018-11-02 21:45:56.087185"], ["updated_at", "2018-11-02 21:45:56.087185"]]
---
        def save_categories
            @categories.each do | category_id |
                HasCategory.create(category_id: category_id, article_id: self.id)