app/views/categories/_category.html.erb


        <h4><%= "Contiene #{category.articles.count} articulo (s)" %></h4>
---
SELECT COUNT(*) FROM "articles" INNER JOIN "has_categories" ON "articles"."id" = "has_categories"."article_id" WHERE "has_categories"."category_id" = ?  [["category_id", 11]]