app/views/categories/show.html.erb

SELECT "articles".* FROM "articles" INNER JOIN "has_categories" ON "articles"."id" = "has_categories"."article_id" WHERE "has_categories"."category_id" = ?  [["category_id", 16]]
---
</div>
<% @category.articles.each do |article|%>